app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 3)

  def new
    @article = Article.new
    @issue = Issue.find(params[:issue]) if params[:issue]
---
SELECT * FROM "issues" WHERE ("issues"."id" = 4)

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("created_at", "title", "author", "updated_at", "issue_id", "georange", "caption", "picture_id", "geotag") VALUES('2009-09-18 11:13:06', 'schanzencrash', '', '2009-09-18 11:13:06', NULL, '', 'bla blab blablabasldblasbda', NULL, '')

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
DELETE FROM "articles" WHERE "id" = 1