app/controllers/issues_controller.rb

SELECT * FROM "issues" WHERE ("issues"."id" = 1)
---
  def show
    @issue = Issue.find(params[:id])

SELECT * FROM "newspapers" WHERE ("newspapers"."id" = 1)
---
  def new
    @issue = Issue.new
    @newspaper = Newspaper.find(params[:newspaper]) if params[:newspaper]

SELECT * FROM "issues" WHERE ("issues"."id" = 4)
---
  def edit
    @issue = Issue.find(params[:id])

INSERT INTO "issues" ("created_at", "updated_at", "newspaper_id", "publish_on", "status") VALUES('2009-09-18 10:53:42', '2009-09-18 10:53:42', NULL, '2009-09-18', 'incomplete')
---
  def create
    @issue = Issue.new(params[:issue])

    respond_to do |format|
      if @issue.save

SELECT * FROM "issues" WHERE ("issues"."id" = 4)
---
  def update
    @issue = Issue.find(params[:id])

SELECT * FROM "issues" WHERE ("issues"."id" = 1)
DELETE FROM "issues" WHERE "id" = 1
---
  def destroy
    @issue = Issue.find(params[:id])
    @issue.destroy