app/controllers/newspapers_controller.rb

  def show
    @newspaper = Newspaper.find(params[:id])
---
SELECT * FROM "newspapers" WHERE ("newspapers"."id" = 1)

  def create
    @newspaper = Newspaper.new(params[:newspaper])

    respond_to do |format|
      if @newspaper.save
---
INSERT INTO "newspapers" ("name", "created_at", "destination_scope", "updated_at", "user_id", "periodicity") VALUES('schanzenblick', '2009-09-18 10:48:03', '20357; schanzenviertel', '2009-09-18 10:48:03', 0, '1 week')